{"config": [{"config": {"padding": "valid", "bias_constraint": null, "activation": "relu", "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 28, 28, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "dtype": "float32", "use_bias": true, "activity_regularizer": null, "name": "conv2d_1", "data_format": "channels_last", "filters": 32, "strides": [2, 2], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "name": "dropout_1", "trainable": true, "noise_shape": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"use_bias": true, "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "name": "dense_1", "units": 128}, "class_name": "Dense"}, {"config": {"use_bias": true, "activation": "softmax", "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "name": "dense_2", "units": 10}, "class_name": "Dense"}], "keras_version": "2.1.3", "class_name": "Sequential", "backend": "tensorflow"}